{
  "message": [
    {
      "date": "2024-08-16",
      "message": "Global business landscape is ever evolving. The disruptions with the technological progress, the imminent metaverse and the changing lifestyles will pose huge demands on the future business leaders. The challenge for any business school is to respond quickly and flexibly to the changing environment and needs of the students. I believe we are at a pivotal moment in the history of business education\n\nAt MICA we have historically been ahead of time to embrace such changes and in providing transformative education to groom the next generation of empathetic leaders. We have made sure to design and deliver quality programmes that would enhance subject knowledge, industry-specific expertise, interdisciplinary insights and encourage personal transformation of our graduates. We are committed to enabling and facilitating truly exciting and stimulating life long learning environments, and experiential education to combine creativity, innovation, entrepreneurship, and management learning on campus. This is also reflected by the employers being consistently impressed by the worth of graduates nurtured by MICA.\n\nMICA has tremendous assets that few others can imitate. Our distinguished faculty produce quality and high impact research, which is recognised world over, thus are thought leaders in their areas. We have a strong group of in-house, adjunct, visiting, alumni and international faculty groups that will engage all students and program participants in a dynamic and interactive classroom environment. MICA truly stands out in its alumni achievements and bonding. Our alumni are highly involved in all aspects of the school’s development.\n\nWe have launched a series of exciting campus activities, leadership learning events, industry immersion, international collaborations, community engagements, summer internship, rural immersion, and international immersion initiatives. Above all, MICA provides an enjoyable campus experience and classroom challenges while building friendships of a lifetime and nurturing a collaborative community as a MICAN emerge and evolve to be a global professional, leader, and citizen.\n\nIt is with pride that I say that MICA will continue to remain an aspiring destination for many brilliant minds. We welcome you to join our inspiring community.\n\nI look forward to working with you all - Welcome to MICA!",
      "vicarName": "Rev. Jose George",
      "id": 1
    }
  ],
  "events": [],
  "heralds": [

  ],
  "almanacs": [
    
  ],
  "users": [
    {
      "id": "45fa",
      "name": "Irure non facere sed",
      "address": "Quaerat ut quo sint ",
      "number": "12345",
      "dob": "2021-02-14",
      "email": "nytop@mailinator.com",
      "baptism": "1974-12-01",
      "confirmation": "1991-10-27",
      "role": "admin",
      "password": "hey"
    },
    {
      "id": "a4d9",
      "name": "Ullam reiciendis pro",
      "address": "Esse voluptatem beat",
      "number": "Animi et quia qui s",
      "dob": "1985-12-15",
      "email": "xyfyci@mailinator.com",
      "baptism": "1980-07-03",
      "confirmation": "1997-07-26",
      "role": "member",
      "password": "kollamchurch"
    },
    {
      "name": "Ipsa qui consectetu",
      "address": "Minus inventore ad p",
      "number": "Veniam officia veni",
      "dob": "1992-06-24",
      "email": "sitac@mailinator.com",
      "baptism": "1975-11-22",
      "confirmation": "2008-04-21",
      "role": "member",
      "password": "kollamchurch",
      "id": "Fsad8Eo"
    }
  ]
}